tests/fixtures/smart_connection.yaml

interactions:
- request:
    body: null
    headers: {}
    method: GET
    uri: https://vcsa/sdk/vimServiceVersions.xml
  response:
    body:
      string: '<?xml version="1.0" encoding="UTF-8" ?><namespaces version="1.0"><namespace><name>urn:vim25</name><version>uA046D008</version><priorVersions><version>8.0.2.0</version><version>8.0.1.0</version><version>8.0.0.2</version><version>8.0.0.1</version><version>8.0.0.0</version><version>7.0.3.2</version><version>7.0.3.1</version><version>7.0.3.0</version><version>7.0.2.1</version><version>7.0.2.0</version><version>7.0.1.1</version><version>7.0.1.0</version><version>7.0.0.2</version><version>7.0.0.0</version><version>6.9.1</version><version>6.8.7</version><version>6.7.3</version><version>6.7.2</version><version>6.7.1</version><version>6.7</version><version>6.5</version><version>6.0</version><version>5.5</version><version>5.1</version><version>5.0</version><version>4.1</version><version>4.0</version></priorVersions></namespace></namespaces>

        '
    headers:
      cache-control:
      - no-cache
      content-length:
      - '843'
      content-type:
      - text/xml; charset=utf-8
      date:
      - Thu, 14 Dec 2023 06:58:26 GMT
      vary:
      - Accept-Encoding
      x-envoy-upstream-service-time:
      - '2'
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="UTF-8"?>

      <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
      xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns:xsd="http://www.w3.org/2001/XMLSchema">

      <soapenv:Body><RetrieveServiceContent xmlns="urn:vim25"><_this versionId="8.0.2.0"
      type="ServiceInstance">ServiceInstance</_this></RetrieveServiceContent></soapenv:Body>

      </soapenv:Envelope>'
    headers:
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - text/xml; charset=UTF-8
      Cookie:
      - ''
      SOAPAction:
      - '"urn:vim25/8.0.2.0"'
      User-Agent:
      - pyvmomi Python/3.9.8 (Darwin; 22.6.0; arm64)
    method: POST
    uri: https://vcsa/sdk
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\"\n
        xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n
        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n<soapenv:Body>\n<RetrieveServiceContentResponse
        xmlns=\"urn:vim25\"><returnval><rootFolder type=\"Folder\">group-d1</rootFolder><propertyCollector
        type=\"PropertyCollector\">propertyCollector</propertyCollector><viewManager
        type=\"ViewManager\">ViewManager</viewManager><about><name>VMware vCenter
        Server</name><fullName>VMware vCenter Server 8.0.3 build-69507950</fullName><vendor>VMware,
        Inc.</vendor><version>8.0.3</version><patchLevel>00000</patchLevel><build>69507950</build><localeVersion>INTL</localeVersion><localeBuild>000</localeBuild><osType>linux-x64</osType><productLineId>vpx</productLineId><apiType>VirtualCenter</apiType><apiVersion>8.0.2.0</apiVersion><instanceUuid>61f12cb6-9de0-40cb-9c47-61d494229f4f</instanceUuid><licenseProductName>VMware
        VirtualCenter Server</licenseProductName><licenseProductVersion>8.0</licenseProductVersion></about><setting
        type=\"OptionManager\">VpxSettings</setting><userDirectory type=\"UserDirectory\">UserDirectory</userDirectory><sessionManager
        type=\"SessionManager\">SessionManager</sessionManager><authorizationManager
        type=\"AuthorizationManager\">AuthorizationManager</authorizationManager><serviceManager
        type=\"ServiceManager\">ServiceMgr</serviceManager><perfManager type=\"PerformanceManager\">PerfMgr</perfManager><scheduledTaskManager
        type=\"ScheduledTaskManager\">ScheduledTaskManager</scheduledTaskManager><alarmManager
        type=\"AlarmManager\">AlarmManager</alarmManager><eventManager type=\"EventManager\">EventManager</eventManager><taskManager
        type=\"TaskManager\">TaskManager</taskManager><extensionManager type=\"ExtensionManager\">ExtensionManager</extensionManager><customizationSpecManager
        type=\"CustomizationSpecManager\">CustomizationSpecManager</customizationSpecManager><guestCustomizationManager
        type=\"VirtualMachineGuestCustomizationManager\">GuestCustomizationManager</guestCustomizationManager><customFieldsManager
        type=\"CustomFieldsManager\">CustomFieldsManager</customFieldsManager><diagnosticManager
        type=\"DiagnosticManager\">DiagMgr</diagnosticManager><licenseManager type=\"LicenseManager\">LicenseManager</licenseManager><searchIndex
        type=\"SearchIndex\">SearchIndex</searchIndex><fileManager type=\"FileManager\">FileManager</fileManager><datastoreNamespaceManager
        type=\"DatastoreNamespaceManager\">DatastoreNamespaceManager</datastoreNamespaceManager><virtualDiskManager
        type=\"VirtualDiskManager\">virtualDiskManager</virtualDiskManager><snmpSystem
        type=\"HostSnmpSystem\">SnmpSystem</snmpSystem><vmProvisioningChecker type=\"VirtualMachineProvisioningChecker\">ProvChecker</vmProvisioningChecker><vmCompatibilityChecker
        type=\"VirtualMachineCompatibilityChecker\">CompatChecker</vmCompatibilityChecker><ovfManager
        type=\"OvfManager\">OvfManager</ovfManager><ipPoolManager type=\"IpPoolManager\">IpPoolManager</ipPoolManager><dvSwitchManager
        type=\"DistributedVirtualSwitchManager\">DVSManager</dvSwitchManager><hostProfileManager
        type=\"HostProfileManager\">HostProfileManager</hostProfileManager><clusterProfileManager
        type=\"ClusterProfileManager\">ClusterProfileManager</clusterProfileManager><complianceManager
        type=\"ProfileComplianceManager\">MoComplianceManager</complianceManager><localizationManager
        type=\"LocalizationManager\">LocalizationManager</localizationManager><storageResourceManager
        type=\"StorageResourceManager\">StorageResourceManager</storageResourceManager><guestOperationsManager
        type=\"GuestOperationsManager\">guestOperationsManager</guestOperationsManager><overheadMemoryManager
        type=\"OverheadMemoryManager\">OverheadMemoryManager</overheadMemoryManager><certificateManager
        type=\"CertificateManager\">certificateManager</certificateManager><ioFilterManager
        type=\"IoFilterManager\">IoFilterManager</ioFilterManager><vStorageObjectManager
        type=\"VcenterVStorageObjectManager\">VStorageObjectManager</vStorageObjectManager><hostSpecManager
        type=\"HostSpecificationManager\">HostSpecificationManager</hostSpecManager><cryptoManager
        type=\"CryptoManagerKmip\">CryptoManager</cryptoManager><healthUpdateManager
        type=\"HealthUpdateManager\">HealthUpdateManager</healthUpdateManager><failoverClusterConfigurator
        type=\"FailoverClusterConfigurator\">FailoverClusterConfigurator</failoverClusterConfigurator><failoverClusterManager
        type=\"FailoverClusterManager\">FailoverClusterManager</failoverClusterManager><tenantManager
        type=\"TenantTenantManager\">TenantManager-69507950</tenantManager><siteInfoManager
        type=\"SiteInfoManager\">SiteInfoManager</siteInfoManager><storageQueryManager
        type=\"StorageQueryManager\">StorageQueryManager</storageQueryManager></returnval></RetrieveServiceContentResponse>\n</soapenv:Body>\n</soapenv:Envelope>"
    headers:
      cache-control:
      - no-cache
      content-length:
      - '4834'
      content-type:
      - text/xml; charset=utf-8
      date:
      - Thu, 14 Dec 2023 06:58:27 GMT
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-envoy-upstream-service-time:
      - '4'
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="UTF-8"?>

      <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
      xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns:xsd="http://www.w3.org/2001/XMLSchema">

      <soapenv:Body><Login xmlns="urn:vim25"><_this versionId="8.0.2.0" type="SessionManager">SessionManager</_this><userName
      versionId="8.0.2.0">my_user</userName><password versionId="8.0.2.0">my_password</password></Login></soapenv:Body>

      </soapenv:Envelope>'
    headers:
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - text/xml; charset=UTF-8
      Cookie:
      - ''
      SOAPAction:
      - '"urn:vim25/8.0.2.0"'
      User-Agent:
      - pyvmomi Python/3.9.8 (Darwin; 22.6.0; arm64)
    method: POST
    uri: https://vcsa/sdk
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\"\n
        xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n
        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n<soapenv:Body>\n<LoginResponse
        xmlns=\"urn:vim25\"><returnval><key>52a67ed8-0f0b-1714-4534-86a177fc5158</key><userName>my_user</userName><fullName>my_user</fullName><loginTime>2023-12-14T06:58:27.937713Z</loginTime><lastActiveTime>2023-12-14T06:58:27.937713Z</lastActiveTime><locale>en</locale><messageLocale>en</messageLocale><extensionSession>false</extensionSession><ipAddress>10.234.46.97</ipAddress><userAgent>pyvmomi
        Python/3.9.8 (Darwin; 22.6.0; arm64)</userAgent><callCount>0</callCount></returnval></LoginResponse>\n</soapenv:Body>\n</soapenv:Envelope>"
    headers:
      cache-control:
      - no-cache
      content-length:
      - '872'
      content-type:
      - text/xml; charset=utf-8
      date:
      - Thu, 14 Dec 2023 06:58:27 GMT
      set-cookie:
      - vmware_soap_session="015fe217ee175cedc4bbcb9bbfb5ccb03097abbf"; Path=/; HttpOnly;
        Secure;
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-envoy-upstream-service-time:
      - '62'
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="UTF-8"?>

      <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
      xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns:xsd="http://www.w3.org/2001/XMLSchema">

      <soapenv:Body><Fetch xmlns="urn:vim25"><_this versionId="8.0.2.0" type="ServiceInstance">ServiceInstance</_this><prop
      versionId="8.0.2.0">content</prop></Fetch></soapenv:Body>

      </soapenv:Envelope>'
    headers:
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - text/xml; charset=UTF-8
      Cookie:
      - vmware_soap_session="015fe217ee175cedc4bbcb9bbfb5ccb03097abbf"; Path=/; HttpOnly;
        Secure;
      SOAPAction:
      - '"urn:vim25/8.0.2.0"'
      User-Agent:
      - pyvmomi Python/3.9.8 (Darwin; 22.6.0; arm64)
    method: POST
    uri: https://vcsa/sdk
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\"\n
        xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n
        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n<soapenv:Body>\n<FetchResponse
        xmlns=\"urn:vim25\"><returnval xsi:type=\"ServiceContent\"><rootFolder type=\"Folder\">group-d1</rootFolder><propertyCollector
        type=\"PropertyCollector\">propertyCollector</propertyCollector><viewManager
        type=\"ViewManager\">ViewManager</viewManager><about><name>VMware vCenter
        Server</name><fullName>VMware vCenter Server 8.0.3 build-69507950</fullName><vendor>VMware,
        Inc.</vendor><version>8.0.3</version><patchLevel>00000</patchLevel><build>69507950</build><localeVersion>INTL</localeVersion><localeBuild>000</localeBuild><osType>linux-x64</osType><productLineId>vpx</productLineId><apiType>VirtualCenter</apiType><apiVersion>8.0.2.0</apiVersion><instanceUuid>61f12cb6-9de0-40cb-9c47-61d494229f4f</instanceUuid><licenseProductName>VMware
        VirtualCenter Server</licenseProductName><licenseProductVersion>8.0</licenseProductVersion></about><setting
        type=\"OptionManager\">VpxSettings</setting><userDirectory type=\"UserDirectory\">UserDirectory</userDirectory><sessionManager
        type=\"SessionManager\">SessionManager</sessionManager><authorizationManager
        type=\"AuthorizationManager\">AuthorizationManager</authorizationManager><serviceManager
        type=\"ServiceManager\">ServiceMgr</serviceManager><perfManager type=\"PerformanceManager\">PerfMgr</perfManager><scheduledTaskManager
        type=\"ScheduledTaskManager\">ScheduledTaskManager</scheduledTaskManager><alarmManager
        type=\"AlarmManager\">AlarmManager</alarmManager><eventManager type=\"EventManager\">EventManager</eventManager><taskManager
        type=\"TaskManager\">TaskManager</taskManager><extensionManager type=\"ExtensionManager\">ExtensionManager</extensionManager><customizationSpecManager
        type=\"CustomizationSpecManager\">CustomizationSpecManager</customizationSpecManager><guestCustomizationManager
        type=\"VirtualMachineGuestCustomizationManager\">GuestCustomizationManager</guestCustomizationManager><customFieldsManager
        type=\"CustomFieldsManager\">CustomFieldsManager</customFieldsManager><diagnosticManager
        type=\"DiagnosticManager\">DiagMgr</diagnosticManager><licenseManager type=\"LicenseManager\">LicenseManager</licenseManager><searchIndex
        type=\"SearchIndex\">SearchIndex</searchIndex><fileManager type=\"FileManager\">FileManager</fileManager><datastoreNamespaceManager
        type=\"DatastoreNamespaceManager\">DatastoreNamespaceManager</datastoreNamespaceManager><virtualDiskManager
        type=\"VirtualDiskManager\">virtualDiskManager</virtualDiskManager><snmpSystem
        type=\"HostSnmpSystem\">SnmpSystem</snmpSystem><vmProvisioningChecker type=\"VirtualMachineProvisioningChecker\">ProvChecker</vmProvisioningChecker><vmCompatibilityChecker
        type=\"VirtualMachineCompatibilityChecker\">CompatChecker</vmCompatibilityChecker><ovfManager
        type=\"OvfManager\">OvfManager</ovfManager><ipPoolManager type=\"IpPoolManager\">IpPoolManager</ipPoolManager><dvSwitchManager
        type=\"DistributedVirtualSwitchManager\">DVSManager</dvSwitchManager><hostProfileManager
        type=\"HostProfileManager\">HostProfileManager</hostProfileManager><clusterProfileManager
        type=\"ClusterProfileManager\">ClusterProfileManager</clusterProfileManager><complianceManager
        type=\"ProfileComplianceManager\">MoComplianceManager</complianceManager><localizationManager
        type=\"LocalizationManager\">LocalizationManager</localizationManager><storageResourceManager
        type=\"StorageResourceManager\">StorageResourceManager</storageResourceManager><guestOperationsManager
        type=\"GuestOperationsManager\">guestOperationsManager</guestOperationsManager><overheadMemoryManager
        type=\"OverheadMemoryManager\">OverheadMemoryManager</overheadMemoryManager><certificateManager
        type=\"CertificateManager\">certificateManager</certificateManager><ioFilterManager
        type=\"IoFilterManager\">IoFilterManager</ioFilterManager><vStorageObjectManager
        type=\"VcenterVStorageObjectManager\">VStorageObjectManager</vStorageObjectManager><hostSpecManager
        type=\"HostSpecificationManager\">HostSpecificationManager</hostSpecManager><cryptoManager
        type=\"CryptoManagerKmip\">CryptoManager</cryptoManager><healthUpdateManager
        type=\"HealthUpdateManager\">HealthUpdateManager</healthUpdateManager><failoverClusterConfigurator
        type=\"FailoverClusterConfigurator\">FailoverClusterConfigurator</failoverClusterConfigurator><failoverClusterManager
        type=\"FailoverClusterManager\">FailoverClusterManager</failoverClusterManager><tenantManager
        type=\"TenantTenantManager\">TenantManager-69507950</tenantManager><siteInfoManager
        type=\"SiteInfoManager\">SiteInfoManager</siteInfoManager><storageQueryManager
        type=\"StorageQueryManager\">StorageQueryManager</storageQueryManager></returnval></FetchResponse>\n</soapenv:Body>\n</soapenv:Envelope>"
    headers:
      cache-control:
      - no-cache
      content-length:
      - '4826'
      content-type:
      - text/xml; charset=utf-8
      date:
      - Thu, 14 Dec 2023 06:58:28 GMT
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-envoy-upstream-service-time:
      - '4'
    status:
      code: 200
      message: OK
- request:
    body: '<?xml version="1.0" encoding="UTF-8"?>

      <soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
      xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
      xmlns:xsd="http://www.w3.org/2001/XMLSchema">

      <soapenv:Body><Fetch xmlns="urn:vim25"><_this versionId="8.0.2.0" type="SessionManager">SessionManager</_this><prop
      versionId="8.0.2.0">currentSession</prop></Fetch></soapenv:Body>

      </soapenv:Envelope>'
    headers:
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - text/xml; charset=UTF-8
      Cookie:
      - vmware_soap_session="015fe217ee175cedc4bbcb9bbfb5ccb03097abbf"; Path=/; HttpOnly;
        Secure;
      SOAPAction:
      - '"urn:vim25/8.0.2.0"'
      User-Agent:
      - pyvmomi Python/3.9.8 (Darwin; 22.6.0; arm64)
    method: POST
    uri: https://vcsa/sdk
  response:
    body:
      string: "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenc=\"http://schemas.xmlsoap.org/soap/encoding/\"\n
        xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"\n
        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\">\n<soapenv:Body>\n<FetchResponse
        xmlns=\"urn:vim25\"><returnval xsi:type=\"UserSession\"><key>52a67ed8-0f0b-1714-4534-86a177fc5158</key><userName>my_user</userName><fullName>my_user</fullName><loginTime>2023-12-14T06:58:27.937713Z</loginTime><lastActiveTime>2023-12-14T06:58:27.937713Z</lastActiveTime><locale>en</locale><messageLocale>en</messageLocale><extensionSession>false</extensionSession><ipAddress>10.234.46.97</ipAddress><userAgent>pyvmomi
        Python/3.9.8 (Darwin; 22.6.0; arm64)</userAgent><callCount>0</callCount></returnval></FetchResponse>\n</soapenv:Body>\n</soapenv:Envelope>"
    headers:
      cache-control:
      - no-cache
      content-length:
      - '895'
      content-type:
      - text/xml; charset=utf-8
      date:
      - Thu, 14 Dec 2023 06:58:28 GMT
      transfer-encoding:
      - chunked
      vary:
      - Accept-Encoding
      x-envoy-upstream-service-time:
      - '4'
    status:
      code: 200
      message: OK
version: 1
